# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# For a list of all formulas/casks: https://formulae.brew.sh

# Install Binaries
#brew 'ack'
#brew 'awscli'
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
#brew 'grep'
#brew 'jp2a'
brew 'mackup'
brew 'mas'
#brew 'openssl'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'rbenv'
#brew 'roundup'
#brew 'ruby-build'
brew 'svn'
#brew 'spaceman-diff'
#brew 'spark' # http://github.com/holman/spark
#brew 'tmate'
#brew 'trash'
#brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'composer'
brew 'git'
brew 'imagemagick'
#brew 'libmemcached'
#brew 'memcached'
brew 'mysql'
brew 'php'
#brew 'php@7.3'
#brew 'php@7.2'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'node'
brew 'redis'
brew 'wireguard-tools'
brew 'yarn'

# Apps
#cask 'adobe-reader'
#cask 'aerial' # screensaver: https://github.com/JohnCoates/Aerial
#cask 'alfred'
#cask 'atom'
cask 'battle-net'
#cask 'brave-browser'
#cask 'caffeine'
cask 'db-browser-for-sqlite'
cask 'discord'
#cask 'docker'
#cask 'dropbox' # seems to be linked to an older download
cask 'dupeguru'
#cask 'dynamodb-local'
#cask 'firefox'
#cask 'garmin-express'
cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'google-drive' # replaced by google-backup-and-sync...?
#cask 'google-featured-photos'
#cask 'google-hangouts'
#cask 'google-notifier'
#cask 'gpgtools'
#cask 'grammarly'
#cask 'insomnia'
cask 'iterm2'
#cask 'java'
#cask 'kindle'
#cask 'kitematic'
#cask 'music-manager'
#cask 'mysqlworkbench'
#cask 'now'
#cask 'phpstorm'
cask 'postman'
#cask 'quip'
#cask 'sequel-pro'
#cask 'scummvm'
#cask 'shuttle'
cask 'skype'
#cask 'slack'
#cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'strongvpn'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tinkerwell'
#cask 'torbrowser'
#cask 'tower'
#cask 'transmit'
#cask 'unrar'
#cask 'utorrent'
cask 'vagrant'
#cask 'viber'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
#cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
#cask 'xee'
#cask 'zerotier-one'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
#mas '1Password', id: 1333542190
#mas 'Battery Monitor: Health, Info', id: 836505650
#mas 'Byword', id: 420212497
#mas 'Deckset', id: 847496013
#mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
#mas 'Sip', id: 507257563
#mas 'Spark', id: 1176895641
#mas 'The Unarchiver', id: 425424353
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
#mas 'WhatsApp', id: 1147396723
mas 'WireGuard', id: 1451685025
mas 'Xcode', id: 497799835
