# Taps
tap 'homebrew/bundle'
tap 'caskroom/cask'
#tap 'caskroom/fonts'
#tap 'homebrew/homebrew-php' # https://github.com/Homebrew/homebrew-php
tap 'caskroom/versions'

# For a list of formulas: http://brewformulas.org/

# Install Binaries
#brew 'ack'
#brew 'awscli'
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
#brew 'grep'
brew 'imagemagick'
#brew 'jp2a'
brew 'mackup'
brew 'mas'
#brew 'openssl'
brew 'php-cs-fixer'
brew 'pkg-config'
#brew 'rbenv'
#brew 'roundup'
#brew 'ruby-build'
#brew 'spaceman-diff'
#brew 'spark' # http://github.com/holman/spark
#brew 'tmate'
#brew 'trash'
#brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
#brew 'php72' # homebrew/homebrew-php
brew 'mysql'
brew 'node'

# For a list of available casks: https://caskroom.github.io/search

# Apps
#cask 'adobe-reader'
cask 'aerial' # screensaver: https://github.com/JohnCoates/Aerial
cask 'alfred'
cask 'atom'
cask 'battle-net'
cask 'brave-browser'
#cask 'caffeine'
cask 'db-browser-for-sqlite'
#cask 'docker'
#cask 'dropbox' # seems to be linked to an older download
cask 'dupeguru'
#cask 'dynamodb-local'
#cask 'firefox'
#cask 'garmin-express'
cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'google-drive' # replaced by google-backup-and-sync...?
#cask 'google-featured-photos'
#cask 'google-hangouts'
#cask 'google-notifier'
#cask 'gpgtools'
#cask 'grammarly'
#cask 'insomnia'
cask 'iterm2'
#cask 'java'
#cask 'kindle'
#cask 'kitematic'
#cask 'music-manager'
#cask 'mysqlworkbench'
#cask 'now'
#cask 'phpstorm'
cask 'postman'
#cask 'quip'
cask 'sequel-pro'
#cask 'scummvm'
#cask 'shuttle'
cask 'skype'
cask 'slack'
#cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'strongvpn-client'
cask 'sublime-text'
cask 'tableplus'
#cask 'torbrowser'
#cask 'tower'
#cask 'transmit'
#cask 'unrar'
#cask 'utorrent'
cask 'vagrant'
#cask 'viber'
cask 'virtualbox'
#cask 'virtualbox-extension-pack'
#cask 'visual-studio-code'
cask 'vlc'
cask 'wireguard-tools'
#cask 'xee'
#cask 'zerotier-one'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

# Fonts
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'

# Install Mac App Store apps
#mas '1Password', id: 1333542190
mas 'Battery Monitor: Health, Info', id: 836505650
#mas 'Byword', id: 420212497
#mas 'Deckset', id: 847496013
#mas 'Giphy Capture', id: 668208984
#mas 'Sip', id: 507257563
#mas 'Spark', id: 1176895641
#mas 'The Unarchiver', id: 425424353
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
mas 'WhatsApp', id: 1147396723

