# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# For a list of all formulas/casks: https://formulae.brew.sh

# Binaries
brew 'android-file-transfer'
#brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'spaceman-diff'
#brew 'spark' # http://github.com/holman/spark
#brew 'stripe/stripe-cli/stripe'
#brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
#brew 'unrar'
#brew 'wget'
#brew 'zlib' # Needed for Memcached
#brew 'zsh'
#brew 'zsh-completions'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'dbngin'
brew 'php'
# brew 'php@8.2'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'composer'
brew 'gh' # GitHub CLI
brew 'git'
brew 'git-flow'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'qcachgrind'
brew 'redis'
brew 'wireguard-tools'
brew 'yarn'

# Apps
# cask '1password'
cask adobe-acrobat-reader
cask android-file-transfer
# cask 'battle-net'
# cask 'caffeine'
# cask 'dbngin'
# cask 'db-browser-for-sqlite'
cask 'discord'
cask 'docker'
# cask 'dupeguru'
# cask 'figma'
# cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
# cask 'gpg-suite'
# cask 'helo'
# cask 'homebrew/cask-drivers/elgato-stream-deck'
cask 'imageoptim'
# cask 'inkscape'
# cask 'insomnia'
cask 'iterm2'
cask 'microsoft-office'
cask 'microsoft-teams'
# cask 'mysqlworkbench'
cask 'ngrok'
# cask 'now'
cask 'pastebot'
# cask 'phpmon'
# cask 'phpstorm'
cask 'postman'
# cask 'quip'
# cask 'ray'
# cask 'screenflow'
# cask 'scummvm'
# cask 'sequel-pro'
# cask 'shuttle'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'strongvpn'
# cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
# cask 'the-unarchiver'
cask 'tinkerwell'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
# cask 'unrar'
# cask 'utorrent'
# virtualbox may have dependencies
# cask 'vagrant'
# cask 'viber'
# virtualbox may have dependencies
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
# cask 'xee'
# cask 'zerotier-one'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'Microsoft 365', id: 1450038993 # Installed via brew...
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
#mas 'Spark', id: 1176895641
#mas 'Speedtest', id: 1153157709
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
#mas 'WhatsApp', id: 1147396723
mas 'WireGuard', id: 1451685025
mas 'Xcode', id: 497799835
